j2ee-app-integrationtest/createreq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://demo.amplexus.org/orderservice/messages">
   <soapenv:Header/>
   <soapenv:Body>
      <mes:CreateOrderRequest>
         <mes:id>1</mes:id>
         <mes:name>craig jackson</mes:name>
         <mes:address>3 blah st blahville</mes:address>
         <mes:email>craig@bigpond.com</mes:email>
         <mes:phoneNumber>0400999999</mes:phoneNumber>
      </mes:CreateOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>
